Revit 2026 API

# ParameterDownloadOptions(ISetElementId, Boolean, Boolean, ForgeTypeId) Constructor

---

Initializes a new instance of the ParameterDownloadOptions class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ParameterDownloadOptions(
	ISet<ElementId> categories,
	bool isInstance,
	bool visible,
	ForgeTypeId groupTypeId
)
```
```vb
Public Sub New (
	categories As ISet(Of ElementId),
	isInstance As Boolean,
	visible As Boolean,
	groupTypeId As ForgeTypeId
)
```
```cpp
public:
ParameterDownloadOptions(
	ISet<ElementId^>^ categories,
	bool isInstance,
	bool visible,
	ForgeTypeId^ groupTypeId
)
```
```fsharp
new :
        categories : ISet<ElementId> *
        isInstance : bool *
        visible : bool *
        groupTypeId : ForgeTypeId -> ParameterDownloadOptions
```

#### Parameters

categories ISetElementId

isInstance Boolean

visible Boolean

groupTypeId ForgeTypeId

#### Reference

ParameterDownloadOptions Class

ParameterDownloadOptions Overload

Autodesk.Revit.DB Namespace